Autodesk.Revit.DB.Structure.Truss.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Curve)
Creates a new Truss.
document:
The document in which the new Truss is created.
trussTypeId:
Element id of the truss type.
sketchPlaneId:
Element id of a SketchPlane.
curve:
The curve of the truss element.
It must be a line, must not be a vertical line, and must be within the sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve points to a helical curve and is not supported for this operation.
-or-
The element id should refer to a valid TrussType.
-or-
The element id should refer to a valid SketchPlane.
-or-
The curve is invalid to be the base curve of a truss.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This function is only enabled in Revit Structure and Revit Architecture.
-or-
Failed to create Truss element.
Since:
2014